sessions/F03-market-open-connection-storm/results/raw/th50-r3-k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/spike.js
        output: -

     scenarios: (100.00%) 1 scenario, 2600 max VUs, 1m0s max duration (incl. graceful stop):
              * market_open: Up to 400.00 iterations/s for 30s over 3 stages (maxVUs: 2600, gracefulStop: 30s)


running (0m00.8s), 0004/2600 VUs, 23 complete and 0 interrupted iterations
market_open   [   3% ] 0004/2600 VUs  00.8s/30s  066.33 iters/s

running (0m01.8s), 0008/2600 VUs, 125 complete and 0 interrupted iterations
market_open   [   6% ] 0008/2600 VUs  01.8s/30s  146.15 iters/s

running (0m02.8s), 0017/2600 VUs, 302 complete and 0 interrupted iterations
market_open   [   9% ] 0017/2600 VUs  02.8s/30s  226.10 iters/s

running (0m03.8s), 0088/2600 VUs, 497 complete and 0 interrupted iterations
market_open   [  13% ] 0088/2600 VUs  03.8s/30s  306.07 iters/s

running (0m04.8s), 0236/2600 VUs, 694 complete and 0 interrupted iterations
market_open   [  16% ] 0236/2600 VUs  04.8s/30s  385.85 iters/s

running (0m05.8s), 0446/2600 VUs, 884 complete and 0 interrupted iterations
market_open   [  19% ] 0446/2600 VUs  05.8s/30s  400.00 iters/s

running (0m06.8s), 0646/2600 VUs, 1084 complete and 0 interrupted iterations
market_open   [  23% ] 0646/2600 VUs  06.8s/30s  400.00 iters/s

running (0m07.8s), 0855/2600 VUs, 1274 complete and 0 interrupted iterations
market_open   [  26% ] 0855/2600 VUs  07.8s/30s  400.00 iters/s

running (0m08.8s), 1062/2600 VUs, 1468 complete and 0 interrupted iterations
market_open   [  29% ] 1062/2600 VUs  08.8s/30s  400.00 iters/s

running (0m09.8s), 1265/2600 VUs, 1664 complete and 0 interrupted iterations
market_open   [  33% ] 1265/2600 VUs  09.8s/30s  400.00 iters/s

running (0m10.8s), 1475/2600 VUs, 1855 complete and 0 interrupted iterations
market_open   [  36% ] 1475/2600 VUs  10.8s/30s  400.00 iters/s

running (0m11.8s), 1676/2600 VUs, 2054 complete and 0 interrupted iterations
market_open   [  39% ] 1676/2600 VUs  11.8s/30s  400.00 iters/s

running (0m12.8s), 1885/2600 VUs, 2244 complete and 0 interrupted iterations
market_open   [  43% ] 1885/2600 VUs  12.8s/30s  400.00 iters/s

running (0m13.8s), 2096/2600 VUs, 2434 complete and 0 interrupted iterations
market_open   [  46% ] 2096/2600 VUs  13.8s/30s  400.00 iters/s

running (0m14.8s), 2295/2600 VUs, 2634 complete and 0 interrupted iterations
market_open   [  49% ] 2295/2600 VUs  14.8s/30s  400.00 iters/s

running (0m15.8s), 2506/2600 VUs, 2824 complete and 0 interrupted iterations
market_open   [  53% ] 2506/2600 VUs  15.8s/30s  400.00 iters/s
time="2026-07-31T10:01:51Z" level=warning msg="Insufficient VUs, reached 2600 active VUs and cannot initialize more" executor=ramping-arrival-rate scenario=market_open

running (0m16.8s), 2595/2600 VUs, 3021 complete and 0 interrupted iterations
market_open   [  56% ] 2595/2600 VUs  16.8s/30s  400.00 iters/s

running (0m17.8s), 2598/2600 VUs, 3214 complete and 0 interrupted iterations
market_open   [  59% ] 2598/2600 VUs  17.8s/30s  400.00 iters/s

running (0m18.8s), 2600/2600 VUs, 3404 complete and 0 interrupted iterations
market_open   [  63% ] 2600/2600 VUs  18.8s/30s  400.00 iters/s

running (0m19.8s), 2597/2600 VUs, 3604 complete and 0 interrupted iterations
market_open   [  66% ] 2597/2600 VUs  19.8s/30s  400.00 iters/s

running (0m20.8s), 2600/2600 VUs, 3794 complete and 0 interrupted iterations
market_open   [  69% ] 2600/2600 VUs  20.8s/30s  400.00 iters/s

running (0m21.8s), 2600/2600 VUs, 3984 complete and 0 interrupted iterations
market_open   [  73% ] 2600/2600 VUs  21.8s/30s  400.00 iters/s

running (0m22.8s), 2593/2600 VUs, 4182 complete and 0 interrupted iterations
market_open   [  76% ] 2593/2600 VUs  22.8s/30s  400.00 iters/s

running (0m23.8s), 2593/2600 VUs, 4374 complete and 0 interrupted iterations
market_open   [  79% ] 2593/2600 VUs  23.8s/30s  400.00 iters/s

running (0m24.8s), 2600/2600 VUs, 4564 complete and 0 interrupted iterations
market_open   [  83% ] 2600/2600 VUs  24.8s/30s  400.00 iters/s

running (0m25.8s), 2600/2600 VUs, 4755 complete and 0 interrupted iterations
market_open   [  86% ] 2600/2600 VUs  25.8s/30s  334.07 iters/s

running (0m26.8s), 2600/2600 VUs, 4945 complete and 0 interrupted iterations
market_open   [  89% ] 2600/2600 VUs  26.8s/30s  253.77 iters/s

running (0m27.8s), 2591/2600 VUs, 5145 complete and 0 interrupted iterations
market_open   [  93% ] 2591/2600 VUs  27.8s/30s  174.13 iters/s

running (0m28.8s), 2535/2600 VUs, 5335 complete and 0 interrupted iterations
market_open   [  96% ] 2535/2600 VUs  28.8s/30s  094.23 iters/s

running (0m29.8s), 2389/2600 VUs, 5535 complete and 0 interrupted iterations
market_open   [  99% ] 2389/2600 VUs  29.8s/30s  015.27 iters/s

running (0m30.8s), 2200/2600 VUs, 5725 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2360/2600 VUs  30s  006.32 iters/s

running (0m31.8s), 2010/2600 VUs, 5915 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2360/2600 VUs  30s  006.32 iters/s

running (0m32.8s), 1810/2600 VUs, 6115 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2360/2600 VUs  30s  006.32 iters/s

running (0m33.8s), 1620/2600 VUs, 6305 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2360/2600 VUs  30s  006.32 iters/s

running (0m34.8s), 1430/2600 VUs, 6495 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2360/2600 VUs  30s  006.32 iters/s

running (0m35.8s), 1240/2600 VUs, 6685 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2360/2600 VUs  30s  006.32 iters/s

running (0m36.8s), 1040/2600 VUs, 6885 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2360/2600 VUs  30s  006.32 iters/s

running (0m37.8s), 0850/2600 VUs, 7075 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2360/2600 VUs  30s  006.32 iters/s

running (0m38.8s), 0659/2600 VUs, 7266 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2360/2600 VUs  30s  006.32 iters/s

running (0m39.8s), 0469/2600 VUs, 7456 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2360/2600 VUs  30s  006.32 iters/s

running (0m40.8s), 0279/2600 VUs, 7646 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2360/2600 VUs  30s  006.32 iters/s

running (0m41.8s), 0079/2600 VUs, 7846 complete and 0 interrupted iterations
market_open ↓ [ 100% ] 2360/2600 VUs  30s  006.32 iters/s


  █ TOTAL RESULTS 

    checks_total.......: 31700  750.590987/s
    checks_succeeded...: 25.00% 7925 out of 31700
    checks_failed......: 75.00% 23775 out of 31700

    ✗ 200 정상 응답
      ↳  99% — ✓ 7924 / ✗ 1
    ✗ 503 부하 차단(의도된 흘려보냄)
      ↳  0% — ✓ 0 / ✗ 7925
    ✗ 500 서버오류(커넥션 타임아웃)
      ↳  0% — ✓ 1 / ✗ 7924
    ✗ 응답 못 받음(status 0)
      ↳  0% — ✓ 0 / ✗ 7925

    CUSTOM
    cnt_200........................: 7924   187.624069/s
    cnt_500........................: 1      0.023678/s
    dur_200_ok.....................: avg=8.37s  min=51.05ms med=9.3s   max=14.93s p(90)=13.46s p(95)=13.66s
    dur_500_error..................: avg=15.25s min=15.25s  med=15.25s max=15.25s p(90)=15.25s p(95)=15.25s

    HTTP
    http_req_duration..............: avg=8.37s  min=51.05ms med=9.3s   max=15.25s p(90)=13.46s p(95)=13.66s
      { expected_response:true }...: avg=8.37s  min=51.05ms med=9.3s   max=14.93s p(90)=13.46s p(95)=13.66s
    http_req_failed................: 0.01%  1 out of 7925
    http_reqs......................: 7925   187.647747/s

    EXECUTION
    dropped_iterations.............: 2074   49.108066/s
    iteration_duration.............: avg=8.37s  min=51.26ms med=9.3s   max=15.25s p(90)=13.46s p(95)=13.66s
    iterations.....................: 7925   187.647747/s
    vus............................: 79     min=4         max=2600
    vus_max........................: 2600   min=2600      max=2600

    NETWORK
    data_received..................: 999 kB 24 kB/s
    data_sent......................: 594 kB 14 kB/s



running (0m42.2s), 0000/2600 VUs, 7925 complete and 0 interrupted iterations
market_open ✓ [ 100% ] 0000/2600 VUs  30s  006.32 iters/s